# 직사각형 별찍기

a, b = map(int, input().strip().split(' '))
for i in range(b):
    print('*' * a)
# 테스트 1 〉	통과 (11.26ms, 7.38MB)
# 테스트 2 〉	통과 (14.37ms, 7.5MB)
# 테스트 3 〉	통과 (11.76ms, 7.48MB)
# 테스트 4 〉	통과 (10.99ms, 7.46MB)
# 테스트 5 〉	통과 (11.60ms, 7.41MB)
# 테스트 6 〉	통과 (11.86ms, 7.58MB)
# 테스트 7 〉	통과 (12.37ms, 7.38MB)
# 테스트 8 〉	통과 (19.91ms, 7.36MB)
# 테스트 9 〉	통과 (16.29ms, 7.43MB)
# 테스트 10 〉	통과 (19.42ms, 7.55MB)
# 테스트 11 〉	통과 (18.42ms, 7.49MB)


# 다른 사람 풀이 -> 반복문을 돌리지 않고도 풀 수 있다!
a, b = map(int, input().strip().split(' '))
answer = ('*'*a +'\n')*b
print(answer)
# 테스트 1 〉	통과 (10.84ms, 7.47MB)
# 테스트 2 〉	통과 (14.26ms, 7.43MB)
# 테스트 3 〉	통과 (10.63ms, 7.55MB)
# 테스트 4 〉	통과 (11.81ms, 7.4MB)
# 테스트 5 〉	통과 (11.37ms, 7.4MB)
# 테스트 6 〉	통과 (10.63ms, 7.64MB)
# 테스트 7 〉	통과 (11.47ms, 7.5MB)
# 테스트 8 〉	통과 (10.98ms, 7.45MB)
# 테스트 9 〉	통과 (11.28ms, 7.69MB)
# 테스트 10 〉	통과 (10.87ms, 7.52MB)
# 테스트 11 〉	통과 (11.56ms, 7.58MB)
